console.log("подключено");
// -const blockName = ['Люди', 'Книги', 'Музыка', 'Истории', 'Истории22'];

export const questions = {
  firstTheme: {
    name: "Люди",
    key: 0,
    questionsNum: ["1 Вопрос", "2 Вопрос", "3 Вопрос", "4 Вопрос", "5 Вопрос"],
    questionsText: [
      "Cколько первогоперво гопервогоперво гопервогоперв огопервого первогопервого первогопервого первогопервогопервого первогоперво гопервогопервог опервогоперв огопервог опервогопе рвогопервогоп ервого ",
      "Сколько второг",
      "Сколько третьего",
      "Сколько четвертого",
      "Сколько пятого",
    ],

    answers: [
      "ответ первого",
      "ответ второго",
      "ответ третьего",
      "ответ четвертого",
      "ответ пятого",
    ],
  },
  secondTheme: {
    name: "Книги",
    key: 1,
    questionsNum: [
      "1 Вопрос2",
      "2 Вопрос2",
      "3 Вопрос2",
      "4 Вопрос2",
      "5 Вопрос2",
    ],
    questionsText: [
      "Cколько первого2",
      "Сколько второго2",
      "Сколько третьего2",
      "Сколько четвертого2",
      "Сколько пятого2",
    ],

    answers: [
      "ответ первого2",
      "ответ второго2",
      "ответ третьего2",
      "ответ четвертого2",
      "ответ пятого2",
    ],
  },
  thirdTheme: {
    name: "Музыка",
    key: 2,
    questionsNum: [
      "1 Вопрос2",
      "2 Вопрос2",
      "3 Вопрос2",
      "4 Вопрос2",
      "5 Вопрос2",
    ],
    questionsText: [
      "Cколько первого2",
      "Сколько второго2",
      "Сколько третьего2",
      "Сколько четвертого2",
      "Сколько пятого2",
    ],

    answers: [
      "ответ первого2",
      "ответ второго2",
      "ответ третьего2",
      "ответ четвертого2",
      "ответ пятого2",
    ],
  },
  fourthTheme: {
    name: "Истории",
    key: 3,
    questionsNum: [
      "1 Вопрос2",
      "2 Вопрос2",
      "3 Вопрос2",
      "4 Вопрос2",
      "5 Вопрос2",
    ],
    questionsText: [
      "Cколько первого2",
      "Сколько второго2",
      "Сколько третьего2",
      "Сколько четвертого2",
      "Сколько пятого2",
    ],

    answers: [
      "ответ первого2",
      "ответ второго2",
      "ответ третьего2",
      "ответ четвертого2",
      "ответ пятого2",
    ],
  },
  fifthTheme: {
    name: "Хз",
    key: 4,
    questionsNum: [
      "1 Вопрос5",
      "2 Вопрос5",
      "3 Вопрос5",
      "4 Вопрос5",
      "5 Вопрос5",
    ],
    questionsText: [
      "Cколько первого5",
      "Сколько второго5",
      "Сколько третьего5",
      "Сколько четвертого5",
      "Сколько пятого5",
    ],

    answers: [
      "ответ первого5",
      "ответ второго5",
      "ответ третьего5",
      "ответ четвертого5",
      "ответ пятого5",
    ],
  },
};
